import streamlit as st

class Car:
    """Автор программы Иванов А.В."""
    class_obj = "Автомобили"  # Объекты класса
    max_speed = 90  # Максимально допустимая скорость на дорогах
    def __init__(self, brand='Ford', weight=900, power=150, colour='Красный'):
        self.brand = brand      # Марка, модель автомобиля
        self.weight = weight    # Вес автомобиля
        self.power = power      # Мощность двигателя
        self.colour = colour    # Мощность двигателя
        self.signal = 'Би-Бип'  # Имитация звука сигнала
    def drive(self):  # Метод двигаться прямо
        st.text("Поехали, двигаемся прямо!")
        st.text("Скорость движения не более - " + str(Car.max_speed))
    def righ(self):  # Метод повернуть на право
        st.text("Едем, поворачиваем руль направо!")
    def left(self):  # Метод повернуть на лево
        st.text("Едем, поворачиваем руль налево!")
    def brake(self):  # Метод тормозить
        st.text("Стоп, активируем тормоз")
    def beep(self):  # Метод подать звуковой сигналь
        st.text("Подан звуковой сигнал")
        st.text(self.signal)

def run_5_1():
    st.markdown('#### 🐍 Класс "Car" - автомобиль')
    st.text('--- Выводим сведения о классе Car ---')
    st.text('Объекты класса-> ' + str(Car.class_obj))
    st.text(Car.__doc__)
    st.text('-' * 55)
    st.text('Создаем объект MyCar_1 (значения свойств по умолчанию)')
    MyCar_1 = Car()
    st.text('Бренд-> ' + str(MyCar_1.brand))
    st.text('Вес-> ' + str(MyCar_1.weight) + ' кг.')
    st.text('Мощность-> ' + str(MyCar_1.power) + ' лс.')
    st.text('Цвет-> ' + str(MyCar_1.colour))
    st.text('-' * 55)
    st.text('Создаем объект MyCar_2 и меняем значения свойств')
    MyCar_2 = Car('Мерседес', 1200, 250, 'Черный')
    st.text('Бренд-> ' + str(MyCar_2.brand))
    st.text('Вес-> ' + str(MyCar_2.weight) + ' кг.')
    st.text('Мощность-> ' + str(MyCar_2.power) + ' лс.')
    st.text('Цвет-> '+ str(MyCar_2.colour))

def run_5_2():
    st.markdown('#### 🐍 Использование методов класса "Car" - автомобиль')
    def drive_car(MyCar):
        st.text('----- Поехал автомобиль '+ str(MyCar.brand) + ' -----')
        MyCar.drive()  # Двигается прямо
        MyCar.righ()   # Поворачиваем направо
        MyCar.drive()  # Двигается прямо
        MyCar.left()   # Поворачиваем налево
        MyCar.drive()  # Двигается прямо
        MyCar.beep()   # Подаем звуковой сигнал
        MyCar.brake()  # Тормозим
        st.text('-' * 50)
        return
    MyCar_1 = Car()
    st.text('Создан автомобиль '+ str(MyCar_1.brand) + ' цвет- '+ str(MyCar_1.colour))
    drive_car(MyCar_1)
    MyCar_2 = Car('Мерседес', 1200, 250, 'Черный')
    st.text('Создан автомобиль ' + str(MyCar_2.brand) + ' цвет- '+ str(MyCar_2.colour))
    drive_car(MyCar_2)

def run_5_3():
    st.markdown('#### 🐍 Модификации общедоступных атрибутов класса "Car" - автомобиль')
    class Car:
        max_speed = 90  # Максимально допустимая скорость на дорогах
        def __init__(self, brand='Ford', weight=900, power=150, colour='Красный'):
            self.brand = brand  # Марка, модель автомобиля
            self.weight = weight  # Вес автомобиля
            self.power = power  # Мощность двигателя
            self.colour = colour  # Мощность двигателя
            self.signal = 'Би-Бип'  # Имитация звука сигнала
    # Изменение общих атрибутов класса
    st.text('Допустимая скорость в исходном классе -> ' + str(Car.max_speed))
    Car.max_speed = 110  # Меняем атрибутов класса
    st.text('Новая скорость в исходном классе -> ' + str(Car.max_speed))
    MyCar = Car()  # Создаем объект
    st.text('Допустимая скорость объекта -> ' + str(MyCar.max_speed))
    MyCar.max_speed = 120  # Изменение атрибута объектов
    st.text('Новая скорость у объекта -> ' + str(MyCar.max_speed))
    st.text('Скорость в исходном классе не изменилась->'  + str(Car.max_speed))
    st.text('-' * 30)
    # Добавление - удаление общих атрибутов класса
    Car.brake_dist = 50  # Добавить атрибут классу (тормозной путь 50 м.)
    st.text('Тормозной путь - ' + str(Car.brake_dist) + ' м.')
    del Car.max_speed  # Удаляем существующий атрибут класса
    st.text('Максимальная скорость - ' + str(hasattr(Car, 'max_speed')))

def run_5_4():
    st.markdown('#### 🐍 Операции над атрибутами объектов встроенными функциями')
    class Car:
        max_speed = 90  # Максимально допустимая скорость на дорогах
        def __init__(self, brand='Ford', weight=900, power=150, colour='Красный'):
            self.brand = brand  # Марка, модель автомобиля
            self.weight = weight  # Вес автомобиля
            self.power = power  # Мощность двигателя
            self.colour = colour  # Мощность двигателя
            self.signal = 'Би-Бип'  # Имитация звука сигнала
    # Изменение общих атрибутов класса
    st.text('Допустимая скорость в исходном классе -> ' + str(getattr(Car, 'max_speed')))
    # Меняем атрибутов класса
    setattr(Car, 'max_speed', 110)
    st.text('Новая скорость в исходном классе -> ' + str(Car.max_speed))
    MyCar = Car()  # Создаем объект
    st.text('Допустимая скорость объекта -> ' + str(getattr(MyCar, 'max_speed')))
    # Изменение атрибута объектов
    setattr(MyCar, 'max_speed', 120)
    st.text('Новая скорость у объекта -> ' + str(getattr(MyCar, 'max_speed')))
    st.text('Скорость в исходном классе не изменилась-> ' + str(Car.max_speed))
    st.text('-' * 30)
    # Добавить атрибут классу (тормозной путь 50 м.)
    setattr(Car, 'brake_dist', 50)
    st.text('Тормозной путь - ' + str(Car.brake_dist) + ' м.')
    # Удаляем существующий атрибут класса
    delattr(Car, 'max_speed')
    st.text('Максимальная скорость - ' + str(hasattr(Car, 'max_speed')))

def run_5_5():
    st.markdown('#### 🐍 Поиск атрибута в объекте класса')
    class Simpl_class:
        attr_class = 0  # Атрибут класса (доступен всем экземплярам)
    my_obj = Simpl_class()  # Создаем объект(экземпляр класса)
    st.text('Начальное значение атрибута -> ' + str(my_obj.attr_class))
    my_obj.attr_class = 111  # Изменяем значение атрибута у объекта
    st.text('Измененное значение атрибута -> ' + str(my_obj.attr_class))
    del my_obj.attr_class  # Удаляем атрибут из объекта (но не класса)
    st.text("Наличие атрибута у объекта -> " + str(hasattr(my_obj, 'attr_class')))
    st.text('Значение атрибута объекта-> ' + str(my_obj.attr_class))
    st.text('Значение атрибута класса-> ' + str(Simpl_class.attr_class))
    # Здесь получим ошибку, т.к. удалять в объекте уже нечего
    try:
        del my_obj.attr_class
    except Exception:
        st.text('Ошибка удаления атрибута')

def run_5_6():
    st.markdown('#### 🐍 Словарь «__dict__» для доступа к атрибутам класса и объектов')
    class My_Class:
        attr_1 = 1  # Атрибут данных класса
        # Метод класса
        def set_attr(self):
            self.attr_2 = 2
    st.text('Словарь с атрибутами класса My_Class')
    st.text(str(My_Class.__dict__))
    st.text('-' * 60)
    My_obj = My_Class()  # Создаем объект (экземпляр класса)
    st.text('     Изменение словарь атрибутов объекта My_obj')
    st.text('До вызова метода set_attr: ' + str(My_obj.__dict__))
    My_obj.set_attr()  # Установим атрибут объекту
    st.text('После вызова метода set_attr: ' + str(My_obj.__dict__))
    My_obj.attr_2 = 222  # Изменим значение атрибута объекта
    My_obj.attr_3 = 333  # Добавим еще один атрибут объекту
    st.text('После изменения атрибута за пределами класса ' + str(My_obj.__dict__))
    My_obj.__dict__['attr_3'] = 99999  # Изменим значение атрибута через словарь
    del My_obj.__dict__['attr_2']  # Удалим атрибут через словарь
    st.text('После изменения атрибута через словарь: ' + str(My_obj.__dict__))
    st.text('-' * 60)
    st.text('Вывод значение атрибута объекта двумя способами')
    st.text('Через словарь объекта -> ' + str(My_obj.__dict__['attr_3']))
    st.text('Через имя объекта -> ' + str(My_obj.attr_3))

def run_5_7():
    st.markdown('#### 🐍 Наследование, создание класса на основе существующих')
    class Super_1:
        attr_0 = 0.001  # Атрибут данных класса
        attr_1 = 11111  # Атрибут данных класса
        def __init__(self):  # Конструктор 1-го супер класса
            self.p_1 = '«Конструктор 1-го супер класса»'
        def method_1(self):  # Метод 1-го супер класса.
            st.text('Это инструкция метода-1 супер класса-1')
    # Создаем 2-й супер класс
    class Super_2:
        attr_0 = 0.002  # Атрибут данных класса
        attr_2 = 22222  # Атрибут данных класса
        def __init__(self):  # Конструктор 2-го супер класса.
            self.p_2 = '«Конструктор 2-го супер класса»'
        def method_2(self):  # Метод 2-го супер класса
            st.text('Это инструкция метода-2 супер класса-2')
    # Создаем подкласс, наследуя оба супер класса
    class Sub_3(Super_1, Super_2):
        attr_0 = 0.003  # Атрибут данных класса
        attr_3 = 3333  # Атрибут данных подкласса
        def method_3(self):  # Метод подкласса
            st.text('Это инструкция метода-3 подкласса - 3')
    # Создаем объект на основе подкласса Sub_3
    obj = Sub_3()
    st.text('----- Атрибуты obj (объекта наследника) -------')
    st.text('Атрибут унаследован от 1-го супер класса (obj.attr_1) -> ' + str(obj.attr_1))
    st.text('Атрибут унаследован от 2-го супер класса (obj.attr_2) -> ' + str(obj.attr_2))
    st.text('Значение собственного атрибута (obj.attr_3) -> ' + str(obj.attr_3))
    st.text('Значение атрибута, с одинаковыми именами во всех классах')
    st.text('Атрибут (obj.attr_0) -> ' + str(obj.attr_0))
    st.text('-' * 60)
    obj.method_1()  # Вызов метода от 1-го супер класса
    obj.method_2()  # Вызов метода от 3-го супер класса
    obj.method_3()  # Вызов собственного метода
    # Можно вызвать только один конструктор
    st.text('Конструктор 1-го супер класса (obj.p_1) -> ' + str(obj.p_1))
    # Получим ошибку - наследуется только один конструктор
    try:
        print('obj.p_2 -> ' + str(obj.p_2))
    except Exception:
        st.text('Ошибка наследования')

def run_5_8():
    st.markdown('#### 🐍 Класс наследник меняет атрибуты базового класса')
    class Super_class:
        attr_1 = 111  # Атрибут данных класса
        def __init__(self):  # Конструктор супер класса
            self.p_1 = '«Конструктор супер класса»'
        def method_1(self):  # 1-й метод супер класса
            st.text('«Это 1-й метод супер класса»')
        def method_2(self):  # 2-й метод супер класса
            st.text('«Это 2-й метод супер класса»')
    # Создаем подкласс - наследник супер класса
    class Sub_class(Super_class):
        attr_1 = 222  # Меняем значение атрибута в подклассе
        attr_3 = 333  # Определяем собственный атрибут данных подкласса
        def __init__(self):  # Переопределяем (расширяем) конструктор
            Super_class.__init__(self)  # Вызываем конструктор супер класса
            self.p_2 = '«Конструктор подкласса»'  # Добавляем свой атрибут
        def method_2(self):  # Переопределяем (расширяем) метод супер класса
            Super_class.method_1(self)  # Вызываем второй метод супер класса
            Super_class.method_2(self)  # Вызываем второй метод супер класса
            # Добавляем собственную инструкцию
            st.text('Это расширение 2-х методов родителя в подклассе')
        def method_3(self):  # Создаем собственный метод подкласса
            st.text('Собственный метод подкласса (method_3)')
    obj = Sub_class()  # Создаем объект на основе Sub_class
    st.text('Этот атрибут переопределен в подклассе (obj.attr_1)-> ' + str(obj.attr_1))
    st.text('-' * 60)
    st.text('Это конструктор супер класса (obj.p_1)-> ' + str(obj.p_1))
    st.text('-' * 60)
    st.text('Это Конструктор подкласс (obj.p_2) -> ' + str(obj.p_2))
    st.text('-' * 60)
    obj.method_1()  # Метод унаследован от супер класса
    st.text('-' * 60)
    obj.method_2()  # Методы супер класса расширен в подклассе
    st.text('-' * 60)
    obj.method_3()  # Собственный метод подкласса

def run_5_9():
    st.markdown('#### 🐍 функция super() для смены атрибутов базового класса')
    class A:
        def method_0():  # Метод супер класса - не будем менять
            st.text('-> 0000  Это method_0 в супер классе  A  <-')
        def method_1(self):  # 1-й метод супер класса
            st.text('-> AAAA  Это method_1 в супер классе A  <-')
        def method_2(self):  # 2-й метод супер класса
            st.text('-> AAAA  Это method_2 в супер классе A  <-')
    # Подкласс - наследник супер класса A
    class B(A):
        def method_1(self):  # Расширяем 1-й метод супер класса A
            # Своя функциональность
            st.text('-> BBBB  Это собственный method_1 в классе B»')
            super().method_2()  # Используем method_2 супер класса A (вариант 1)
            super(B, self).method_2()  # Используем method_2 супер класса A (вариант 2)
    # Создаем объект из подкласса B
    obj = B()
    # Вызываем методы классов
    obj.method_1()  # Сработает method_1 класса B
    st.text('-' * 45)
    obj.method_2()  # Сработает method_2 класса A
    st.text('-' * 45)
    super(B, obj).method_1()  # Сработает method_1 класса A
    st.text('-' * 45)
    A.method_0()  # Сработает method_0 класса A

def run_5_10():
    st.markdown('#### 🐍 Цепочка наследований в классах')
    class A:
        def method_0():  # Метод супер класса - не будем менять
            st.text('-> 0000  Это method_0 в супер классе  A  <-')
        def method_1(self):  # 1-й метод супер класса
            st.text('-> AAAA  Это method_1 в супер классе A  <-')
        def method_2(self):  # 2-й метод супер класса
            st.text('-> AAAA  Это method_2 в супер классе A  <-')
    # Первый подкласс - наследник супер класса A
    class B(A):
        def method_1(self):  # Расширяем 1-й метод супер класса A
            # Используем метод супер класса A.
            # Можно и через super().method_1().
            super(B, self).method_1()
            # Своя функциональность
            st.text('-> BBBB  Это method_1 в классе B»')
    # Второй подкласс - наследник супер класса B
    class C(B):
        # Расширяем 2-й метод супер класса A.
        def method_2(self):
            super(B, self).method_2()  # Используем метод супер класса A
            # Своя функциональность
            st.text('-> CCCC Это method_2 в классе C  <-')
    # Создаем объект из подкласса C
    obj = C()
    # Вызываем методы классов
    obj.method_1()
    st.text('-' * 45)
    obj.method_2()
    st.text('-' * 45)
    super(B, obj).method_1()
    st.text('-' * 45)
    super(B, C).method_0()

def run_5_11():
    st.markdown('#### 🐍 Наследование супер классов с одноименными атрибутами')
    class A:
        # Устанавливаем экземпляру атрибуты
        def set_a(self):
            self.x = 111  # Обычный атрибут
            self.__y = 111  # y изменяется в _A__y.
        # Получаем атрибуты
        def get_a(self):
            st.text(self.x)
            st.text(self.__y)
    # 2-й супер класс
    class B:
        # Устанавливаем экземпляру атрибуты
        def set_b(self):
            self.x = 222  # Обычный атрибут
            self.__y = 222  # y изменяется в _B__y
        # Получаем атрибуты
        def get_b(self):
            st.text(self.x)
            st.text(self.__y)
    # Пустой класс, наследник 2-х супер классов
    class C(A, B):
        pass
    # Создаем объект на основе класса C
    obj = C()
    st.text('Исходный словарь атрибутов класса "C" ')
    st.text(obj.__dict__)
    st.text('-' * 60)
    obj.set_a()  # Теперь obj.x == 1 и _A__y == 1.
    st.text('Словарь атрибутов класса "C" после вызова метода obj.set_a()')
    st.text(obj.__dict__)
    st.text('-' * 60)
    obj.set_b()  # obj.x переопределен на 2 и _B__y == 2.
    st.text('Словарь атрибутов класса "C" после вызова метода obj.set_b()')
    st.text(obj.__dict__)
    st.text('-' * 60)
    st.text('Значения атрибутов класса "C" при вызове метода obj.get_a()')
    obj.get_a()
    st.text('-' * 60)
    st.text('Значения атрибутов класса "C" при вызове метода obj.get_b()')
    obj.get_b()

def run_5_12():
    st.markdown('#### 🐍Инкапсуляция в классах')
    class Person:
        def __init__(self):
            self.open_atr = 'Демонстрации инкапсуляции'  # Открытый атрибут
            self.__name = None  # Имя (закрытый атрибут)
            self.__age = None  # Возраст (закрытый атрибут)
        # Метод - установить (принять) имя
        def set_name(self, name):
            self.__name = name
        # Метод - установить (принять) возраст
        def set_age(self, age):
            if 1 < age < 110:
                self.__age = age
            else:
                st.text("Недопустимый возраст")
        # Метод - получить (отдать) возраст
        def get_age(self):
            return self.__age
        # Метод - получить (отдать) имя
        def get_name(self):
            return self.__name
        # Метод - получить (отдать) информацию о персоне
        def display_info(self):
            st.text(f"Имя: {self.__name}\tВозраст: {self.__age}")
    my_per = Person()
    st.text('Информация о человеке при инициализации класса')
    my_per.display_info()
    st.text('-' * 25)
    my_per.set_name('Иванов Иван Иванович')  # Передаем в класс имя
    st.text('Информация о человеке после передачи в класс имени')
    my_per.display_info()
    st.text('-' * 25)
    st.text('Попытка передать в класс ошибочного возраста')
    my_per.set_age(-3486)  # Передаем в класс недопустимый возраст
    st.text('-' * 25)
    my_per.set_age(25)  # Передаем в класс возраст
    st.text('Информация о человеке после передачи в класс возраста')
    my_per.display_info()
    st.text('-' * 25)
    st.text('Получить отдельно: имя, возраст')
    st.text(my_per.get_name())
    st.text(my_per.get_age())
    st.text('-' * 25)
    st.text('Вывод открытых атрибутов класса')
    st.text(my_per.open_atr)
    st.text('Вывод закрытых атрибутов класса')
    try:
        st.text(my_per.__name)  # Выдаст ошибку - закрытый атрибут
    except Exception:
        st.text('Ошибка: попытка вывести закрытый атрибут')
    try:
        st.text(my_per.__age)  # Выдаст ошибку - закрытый атрибут
    except Exception:
        st.text('Ошибка: попытка вывести закрытый атрибут')
    st.text('=' * 50)
    st.text('Но все же возможен вывод закрытых атрибутов класса')
    st.text(my_per._Person__name)
    st.text(my_per._Person__age)

if __name__ == '__main__':
    run_5_1()