import streamlit as st

def run_3_1():
    from math import pi  # Инструкция импортирует переменную pi из модуля math
    st.markdown('#### 🐍 Инструкции в Python')

    x, y, z = [1, 2, 3]  # Позиционное присваивание значений переменным

    # Эта инструкция объявляет функцию со значением по умолчанию
    def my_func(z=10):
        s_1 = z ** 2

        for i in range(25):  # Инструкция запускает цикл
            if i < 5:  # Условная инструкция
                continue  # Инструкция перехода в начало цикла
            elif 5 <= i < 10:
                s_1 += i  # Увеличиваем z на значение из i
            else:
                break  # Инструкция прерывания цикла
        return s_1  # Инструкция возврата значения функции

    try:  # Инструкция будет обрабатывать исключения (ошибки)
        a_1 = my_func(z)  # инструкция обращения к функции
        res = a_1 + int(pi) * 10 + x + y  # инструкция выполнения арифметических операций
        st.text("Результат вычислений res=" + str(res))  # Инструкция выводит результат

    except Exception as err:  # Блок выполняется, когда есть ошибка
        st.text(err)  # Выводим сообщение об ошибке
    else:  # Если ошибок нет
        pass  # Ничего не делаем (пустая инструкция-заполнитель)
    finally:  # Этот блок выполняется всегда, даже при наличии ошибки
        st.text('Конец программы')

def run_3_2():
    st.markdown('#### 🐍 Выражения в Python')
    list_1 = [x * 10 for x in (0, 1, 2, 3) if x > 0 and x != 3]
    st.text('Список ->' + str(list))
    # Анонимная функция и ее вызов в арифметическом выражении
    res = (lambda a, b: a + b)(list_1[0], list_1[1]) ** 2
    # Выражение с вызовом функции
    if res in [900, 1000] and type(res) is int:
        st.text('Результат ->' + str(res))

def run_3_3():
    st.markdown('#### 🐍 Операторы в Python')
    st.text("Приоритет оператора '*' выше, чем у '+'")
    a = 6 + 9 * 2
    st.text('6 + 9 * 2 ->' + str(a))
    st.text("Скобки сменили приоритет, теперь '+' выше, чем у '*'")
    b = (6 + 9) * 2
    st.text('(6 + 9) * 2 ->' + str(b))
    st.text('-' * 50)
    c = 2
    st.text('Приоритет слева-> направо.')
    st.text('a < b > c ->' + str(a < b > c))
    st.text("Скобки сменили приоритет, теперь налево <- справа.")
    st.text('a < (b > c) ->' + str(a < (b > c)))
    st.text('-' * 50)
    # Согласно принятому порядку это тоже самое, что и c = (a = b)
    st.text("Здесь по умолчанию приоритет налево <- справа.")
    st.text("Как будто присутствуют скобки c = (a = b).")
    st.text('b=' + str(b))
    st.text('a=' + str(a))
    c = a = b
    st.text('c = a = b ->' + str(a))
    st.text('-' * 50)
    st.text('Операторы "-" и "-" имеют равный приоритет.')
    st.text('По умолчанию левая ассоциативность.')
    st.text('Как будто присутствуют скобки  d = (5 - 6) - 7')
    d = 5 - 6 - 7
    st.text('5 - 6 - 7 ->' + str(d))
    st.text('-' * 50)
    st.text('По умолчанию левая ассоциативность.')
    st.text('Как будто присутствуют скобки  d = (0 and 0) or 1')
    d = 0 and 0 or 1
    st.text('0 and 0 or 1 ->' + str(d))
    st.text('-' * 50)
    st.text('Теперь правая ассоциативность.')
    st.text('Так как операция в скобках выполняется первой.')
    d = 0 and (0 or 1)
    st.text('0 and (0 or 1) ->' + str(d))

def run_3_4():
    st.markdown('#### 🐍 Операторы «*» и «**» (распаковка словарей, кортежей и списков)')
    st.text('Исходный список фруктов')
    fruits = ['Лимоны', 'Апельсины', 'Мандарины', 'Яблоки']
    st.text('Фрукты ->' + str(fruits))
    st.text('----- Распаковываем список фруктов -----')
    f_1, f_2, *f_3 = fruits
    st.text('f_1->' + str(f_1))
    st.text('f_2->' + str(f_2))
    st.text('f_3->' + str(f_3))
    st.text('Тип данных fruits->' + str(type(fruits)))
    st.text('Тип данных f_3->' + str(type(f_3)))
    st.text('=' * 30)
    st.text('Исходный кортеж овощей')
    vegetables = ('Огурцы', 'Помидоры', 'Капуста', 'Морковь')
    st.text('Овощи ->' + str(vegetables))
    st.text('----- Распаковываем кортеж овощей -----')
    ov_1, ov_2, *ov_3 = vegetables
    st.text('ov_1->' + str(ov_1))
    st.text('ov_2->' + str(ov_2))
    st.text('ov_3->' + str(ov_3))
    st.text('Тип данных vegetables->' + str(type(vegetables)))
    st.text('Тип данных ov_3->' + str(type(ov_3)))
    st.text('=' * 30)
    st.text('Исходные словари')
    d_1 = {1: "Пн", 2: "Вт", '3': "Ср"}
    d_2 = {4: "Чт", 5: "Пт", '6': "Сб", 7: "Вс"}
    st.text('d_1 ->' + str(d_1))
    st.text('d_2 ->' + str(d_2))
    st.text('----- Объединенный словарь -----')
    all_d = {**d_1, **d_2}
    st.text(str(all_d))

def run_3_5():
    st.markdown('#### 🐍 Каноническая форма присваивания')
    a = 5 + 0.3 + 5 ** 2
    st.text('Присваивание из выражения ->' + str(a))
    b = [1, 1, 2]
    st.text('Присваивание из списка ->' + str(b))
    c = ('A', 'B', 'C')
    st.text('Присваивание из кортежа ->' + str(c))

def run_3_6():
    st.markdown('#### 🐍 Комбинированные инструкции присваивания')
    # Присвоили начальное значение
    a = 3
    st.text('a = 3 ->' + str(a))
    a += 6  # Это равнозначно a = a + 6
    st.text('a += 6 ->' + str(a))
    a *= 2  # Это равнозначно a = a*2
    st.text('a *= 2 ->' + str(a))
    a /= 2  # Это равнозначно a = a/2
    st.text('a /= 2 ->' + str(a))
    a **= 2  # Это равнозначно a = a**2
    st.text('a **= 2 ->' + str(a))
    a %= 2  # Это равнозначно a = a%2
    st.text('a %= 2 ->' + str(a))

def run_3_7():
    st.markdown('#### 🐍 Оценка разности времени выполнения операций присваивания')
    with st.spinner("Ждите, идет процесс присваивания...", show_time=True):
        # Импортируем модуль time
        import time
        # Получаем стартовое значение времени
        t_1 = time.time()
        # Запускаем цикл 10 млн. раз
        for i in range(0, 10 ** 7):
            # Обычное присваивание
            li = [0, 1]
            li = li + [2, 3]
            li = li + [4, 5]
            del li
        # Получаем конечное значение времени
        t_2 = time.time()
        t3 = round((t_2 - t_1), 13)
        st.text('Каноническая форма присваивания ->' + str(t3) + 'сек.')
        # То-же самое, но для комбинированного присваивания
        t_1 = time.time()
        # Запускаем цикл 10 млн. раз
        for i in range(0, 10 ** 7):
            # Комбинированное присваивание
            li = [0, 1]
            li += [2, 3]
            li += [4, 5]
            del li
        # Получаем конечное значение времени
        t_2 = time.time()
        t3 = round((t_2 - t_1), 13)
        st.text('Комбинированная форма присваивания ->' + str(t3) + 'сек.')

def run_3_8():
    st.markdown('#### 🐍 Позиционное присваивание')
    st.text('Позиционное присваивание значений переменным "a" и "b"')
    a, b = 1, 2
    st.text('Выражение: a, b = 1, 2')
    st.text('a ->' + str(a) + ', b ->' + str(b))
    # Позиционное присваивание из списка
    a, b = [3, 4]
    st.text('Выражение: a, b = [3, 4]')
    st.text('a ->' + str(a) + ', b ->' + str(b))
    # Позиционное присваивание списку из списка
    [a, b] = [4, 5]
    st.text('Выражение: [a, b] = [4, 5]')
    st.text('a ->' + str(a) + ', b ->' + str(b))
    # Позиционное присваивание строки списку
    [a, b] = 'AB'
    st.text("Выражение: [a, b] = 'AB'")
    st.text('a ->' + str(a) + ', b ->' + str(b))

def run_3_9():
    st.markdown('#### 🐍 Присваивание с распаковкой последовательностей')
    a, b, *c = [1, 2, 3, 4, 5]
    st.text('Выражение: a, b, *c = [1, 2, 3, 4, 5]')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    *a, b, c = [1, 2, 3, 4, 5]
    st.text('Выражение: *a, b, c = [1, 2, 3, 4, 5]')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    a, *b, c = [1, 2, 3, 4, 5]
    st.text('Выражение: a, *b, c = [1, 2, 3, 4, 5]')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    a, b, *c = [1, 2, 3]
    st.text('Выражение: a, b, *c = [1, 2, 3]')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    a, b, *c = [1, 2]
    st.text('Выражение: a, b, *c = [1, 2]')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    *c, = [1, 2]
    st.text('Выражение: c, = [1, 2]')
    st.text('Итог: c ==' + str(c))

def run_3_10():
    st.markdown('#### 🐍 Групповое присваивание одного значения')
    a = "Иванов"
    b = a
    c = b
    st.text('Выражение: a = "Иванов", b = a, c = b')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    # Групповое присваивание
    c = b = a = "Ok"
    st.text('Выражение: c = b = a = "Ok"')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))

def run_3_11():
    st.markdown('#### 🐍 Групповое присваивание для неизменяемых и изменяемых объектов')
    st.text('Для неизменяемого объекта - число')
    c = b = a = 111
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    # Изменим b и c
    b = 1
    c = 2
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    # Используем список (изменяемый объект)
    st.text('Для изменяемого объекта - список')
    c = b = a = []
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    # Пробуем изменить b и c
    b += [1]
    c += [2]
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))

def run_3_12():
    st.markdown('#### 🐍 Выражения присваивания (оператор «морж»)')
    st.text('Оператор "морж" в Python с версии 3.8')
    # В выражении инициализируются сразу 3 переменные.
    a = (b := 3) + (c := 5)
    st.text('Выражение: a = (b := 3) + (c := 5)')
    st.text('Итог: a->'+ str(a) + ', b ->'+ str(b) + ', c ->'+ str(c))
    st.text('-' * 40)
    # Список функций (для однозначности используем скобки).
    list_1 = [(x_1 := lambda y: y ** 2), (x_2 := lambda y: y ** 3)]
    st.text('Выражение: list_1 = [(x_1 := lambda y: y**2), (x_2 := lambda y: y**3)]')
    st.text('-' * 40)
    z = 3
    st.text('Результаты вычислений при z=3')
    st.text('Список: ' + 'list_1[0] ->' + str(list_1[0](z)) + ', list_1[1] ->' + str(list_1[1](z)))
    st.text('Значения переменных: ' + 'x_1 ->'+ str(x_1(z)) + ', x_2 ->'+ str(x_2(z)))
    st.text('-' * 40)
    z = 5
    st.text('Результаты вычислений при z=5')
    st.text('Список: ' + 'list_1[0] ->'+ str(list_1[0](z)) + ', list_1[1] ->' + str(list_1[1](z)))
    st.text('Значения переменных: ' + 'x_1 ->'+ str(x_1(z)) + ', x_2 ->' + str(x_2(z)))

def run_3_13():
    st.markdown('#### 🐍 Простейшая форма инструкции if')
    num_1 = 10
    num_2 = 20
    if num_1 > num_2:
        s = num_1 + num_2
    s = num_1 * num_2
    st.text('Результат s=' + str(s))

def run_3_14():
    st.markdown('#### 🐍 Управляющая конструкция if/else')
    num_1 = 10
    num_2 = 20
    if num_1 > num_2:
        s = num_1 + num_2
    else:
        s = num_1 * num_2
    st.text('Результат s=' + str(s))

def run_3_15():
    st.markdown('#### 🐍 Использование инструкции «if» и ключевых слов «elif»')
    JVS = 20000
    Sony = 30000
    Samsung = 40000
    TV = 1
    # TV = 2
    # TV = 3
    # TV = 4
    # Осуществляем проверку условных выражений.
    if TV == 1:
        st.text('Введен код ->' + str(TV) + ', Цена JVS->' + str(JVS))
    elif TV == 2:
        st.text('Введен код ->' + str(TV) + ', Цена Sony->' + str(Sony))
    elif TV == 3:
        st.text('Введен код ->' + str(TV) + ', Цена Samsung->' + str(Samsung))
    else:
        st.text('Введен код ->' + str(TV) + ', Нет в продаже!')

def run_3_16():
    st.markdown('#### 🐍 Однострочная инструкция if/else')
    x = 15
    y = 10
    # Обычная инструкция
    if x > y:
        s = x + y
    else:
        s = x - y
    st.text('Обычная инструкция: s=' + str(s))
    # Трехместное выражение
    s = x + y if x > y else x - y
    st.text('Трехместное выражение: s=' + str(s))

def run_3_17():
    st.markdown('#### 🐍 Использование выражения if/else для игнорирования ошибок')
    x, y = 0, 3
    res = x / y if y != 0 else 'Операция не выполнима (деление на 0)!'
    st.text('res->' + str(res))
    # Деление на 0 не допустимо
    x, y = 3, 0
    res = x / y if y != 0 else 'Операция не выполнима (деление на 0)!'
    st.text('res->' + str(res))

def run_3_18():
    st.markdown('#### 🐍 Инструкция организации цикла "for/in"')
    list_1 = [2, 5, 9, 4]
    st.text('Список ->'+ str(list_1))
    # Цикл перебора элементов списка
    for elem in list_1:
        st.text('Элемент списка ->'+ str(elem))
    st.text('-' * 30)
    # Формируем кортеж
    kor = ['Иванов', 'Петров', 'Сидоров', 'Смирнов']
    st.text('Кортеж ->'+ str(kor))
    # Цикл перебора элементов кортежа
    for elem in kor:
        st.text('Элемент кортежа ->'+ str(elem))
    st.text('-' * 30)
    sum = 0  # Задаем начальную сумму
    # Запускаем цикл получения суммы элементов списка
    for elem in list_1:
        sum += elem
    st.text('Сумма элементов списка ->'+ str(sum))

def run_3_19():
    st.markdown('#### 🐍 Инструкция "for" с ключевыми словами "break" и "else"')
    list_1 = [1, 2, 3, 4, 5]
    st.text('Список - ' + str(list_1))
    sum = 0  # Задаем начальную сумму
    max_sum = 8  # Задаем предельную сумму
    # max_sum = 40 # Задаем предельную сумму
    # Запускаем цикл по элементам списка
    for elem in list_1:
        if sum < max_sum:  # Если сумма чисел меньше max_sum
            sum += elem  # Увеличиваем сумму
        else:  # Если сумма чисел больше max_sum
            st.text("Сумма больше числа-"+ str(max_sum) + "(прерываем цикл)!")
            break  # прерываем цикл
    else:  # Если цикл не был прерван
        st.text("Сумма элементов списка sum ="+ str(sum))
    # Выводим сообщение о завершении проверки
    st.text("Конец работы программы!")

def run_3_20():
    st.markdown('#### 🐍 Организация цикла с инструкцией for и функцией range()')
    st.text('Все числа в диапазоне от 0 до 5 - range(5)')
    for i in range(5):
        st.text('i='+ str(i))
    st.text('-' * 5)
    st.text('Все числа в диапазоне от 2 до 5 - range(2, 5)')
    for i in range(2, 5):
        st.text('i='+ str(i))
    st.text('-' * 5)
    st.text('Все числа в диапазоне от 3 до 16 с шагом 3 - range(3, 16, 3)')
    for i in range(3, 16, 3):
        st.text('i='+ str(i))

def run_3_21():
    st.markdown('#### 🐍 Организация цикла с инструкцией for и функцией range()')
    list_1 = [10, 20, 30, 40, 50]
    st.text('Список - '+ str(list_1))
    for i in range(len(list_1)):
        s = list_1[i] * 2
        st.text('list_1[i]='+ str(list_1[i]) + ', s='+ str(s))

def run_3_22():
    st.markdown('#### 🐍 Варианты организации циклических структур')
    name = 'Привет'
    txt = ''
    for s in name: txt = txt + s
    st.text(txt)
    st.text('-' * 20)
    name = 'ПPрyиtвoеnт'
    txt = ''
    # Используем функцию range(a, b, step).
    for n in range(0, len(name), 2):
        # Выводим буквы через одну, начиная с первой
        txt = txt + name[n]
    st.text(txt)
    st.text('-' * 20)
    txt = ''
    for n in range(1, len(name), 2):
        # Выводим буквы через одну, начиная со второй
        txt = txt + name[n]
    st.text(txt)
    st.text('-' * 20)
    # Выводим ключи и значения словаря
    d = {'Один': 1, 'Два': 2}
    for key in d: st.text(str(key) + '-> ' + str(d[key]))
    st.text('-' * 20)
    # Перебираем список и находим суммы элементов кортежей
    sum_1 = []
    d = [(1, 2), (3, 4), (5, 6)]
    for x, y in d: sum_1.append(x + y)
    st.text(str(sum_1))

def run_3_23():
    st.markdown('#### 🐍 Цикл while')
    s = 0
    while s < 100:
        s = s + 1
    st.text('Цикл окончен, s=' + str(s))

def run_3_24():
    st.markdown('#### 🐍 Цикл while с инструкциями "else" и "break"')
    list_1 = [1, 2, 3, 4, 5]
    st.text(list_1)
    sum_1 = 0  # Задаем начальную сумму
    max_sum = 8  # Задаем предельную сумму
    # max_sum = 40    # Задаем предельную сумму
    i = 0  # Устанавливаем счетчик итераций
    # Запускаем цикл по элементам списка
    while i < len(list_1):
        if sum_1 < max_sum:  # Если сумма чисел меньше max_sum
            sum_1 += list_1[i]  # Увеличиваем сумму
            i += 1  # Счетчик увеличиваем на 1
        else:  # Если сумма чисел больше max_sum
            st.text("Сумма больше числа-" + str(max_sum) + "(прерываем цикл)!")
            break  # прерываем цикл
    else:  # Если цикл не был прерван
        st.text("Сумма элементов списка sum =" + str(sum_1))
    # Выводим сообщение о завершении проверки
    st.text("Конец работы программы!")

def run_3_25():
    st.markdown('#### 🐍 Бесконечный цикл while с инструкциями "break"')
    i = 1  # Устанавливаем значение счетчика циклов
    txt = ''
    while True:  # Запускаем бесконечный цикл
        txt = txt + str(i) + ', '
        i += 1  # Увеличиваем счетчик циклов на 1
        if i > 5: break  # Выходим из цикла если i > 5
    st.text(txt)  # Выводим номера итерации

def run_3_26():
    st.markdown('#### 🐍 Использование в тела цикла инструкций "break" и "continue"')
    k = 1  # Устанавливаем счетчик циклов
    st.text('Бесконечный цикл инструкцией - while True:')
    counter = []
    while True:  # Запускаем бесконечный цикл
        if k > 10:  # Задаем условие прерывания цикла
            break  # Прерываем цикл и идем дальше
        if k % 2 == 0:  # Отсеиваем четные числа
            k += 1  # Увеличиваем счетчик циклов на 1
            continue  # Возвращаемся в заголовок цикла
        counter.append(k)
        k += 1  # Увеличиваем счетчик циклов на 1
    # Печать результатов после завершения цикла
    st.text('Вывод нечетных чисел окончен!')
    st.text(str(counter))
    list_1 = list(range(1, 21))  # Формируем список чисел от 1 до 20
    st.text('Цикл по элементам списка инструкцией - for k in list:')
    counter = []
    for k in list_1:  # Запускаем цикл по элементам списка
        if k > 10:  # Задаем условие прерывания цикла
            break  # Прерываем цикл и идем дальше
        if k % 2 == 0:  # Отсеиваем четные числа
            k += 1  # Увеличиваем счетчик циклов на 1
            continue  # Возвращаемся в заголовок цикла
        counter.append(k)
        k += 1  # Увеличиваем счетчик циклов на 1
    # Печать результатов после завершения цикла
    st.text('Вывод нечетных чисел окончен!')
    st.text(str(counter))

def run_3_27():
    st.markdown('#### 🐍 Организация вложенных циклов')
    st.text('Таблица умножения чисел от 2 до 5')
    y = 1  # Задаем стартовое значение счетчика внутреннего цикла
    for x in range(1, 11):  # Внешний цикл
        if x == 1:  # Если x==1, то умножение на 1 пропускаем
            continue  # Переходим в начало внешнего цикла for
        while True:  # Внутренний цикл
            if y == 1:  # Умножение на 1 пропускаем
                y += 1  # Увеличиваем счетчик внутреннего цикла на единицу
                continue  # Переходим в начало внутреннего цикла while
            st.text(str(x) + ' x '+ str(y) + ' = ' + str(x * y))  # Выводим произведение чисел

            if y == 5:  # Если y==5
                st.text('----------')  # Переходим на новую строку
                y = 2  # Задаем новое стартовое значение счетчика внутреннего цикла
                break  # Прерываем внутренний цикл (внешний нет)
            y += 1  # Увеличиваем счетчик внутреннего цикла на единицу
        if x == 5:  # Если x==5
            break  # Прерываем внешний цикл
    # Выводим сообщение о завершении циклов и все программы
    st.text('Программа завершила работу!')

def run_3_28():
    st.markdown('#### 🐍 Итераторы и итераций в Python')
    list_1 = [1, 2, 3, 4, 5]
    # Запускаем цикл по элементам списка
    for elem in list_1:
        st.text("Значение объекта-итератора ->" + str(elem))

def run_3_29():
    st.markdown('#### 🐍 Итераторы: функции iter(), next() и метод __next__()')
    st.text('----- Создаем список "x" из строк -----')
    x = ["apple", "banana", "cherry"]
    st.text('Список "x":  ' + str(x))
    st.text('*' * 60)
    st.text('----- Создаем объект-итератор "x" из списка строк -----')
    x = iter(["apple", "banana", "cherry"])
    st.text('Объект-итератор "x":  ' + str(x))
    st.text('*' * 60)
    st.text('----- Вывод элементов итератора функцией next(x) ----- ')
    st.text(str(next(x)))
    st.text(str(next(x)))
    st.text(str(next(x)))
    st.text('*' * 60)
    st.text('----- Создаем объект-итератор - "x" из списка чисел -----')
    x = iter([1, 2, 3])
    st.text('Объект-итератор "x":  ' + str(x))
    st.text('*' * 60)
    st.text('----- Вывод элементов итератора методом __next__() -----')
    st.text(str(x.__next__()))
    st.text(str(x.__next__()))
    st.text(str(x.__next__()))

def run_3_30():
    st.markdown('#### 🐍 Функции hasattr() и методов «__iter__()» и «__getitem__()»')
    s = 'Программа на Python'
    st.text('Исходная строка ->  '+ str(s))
    st.text('Поддерживают ли строки итерации ->'+ str(hasattr(s, '__iter__')))
    st.text('Поддерживают ли строки порядок следования элементов ->:' + str(hasattr(s, '__getitem__')))
    st.text('----- Цикл обхода символов строки -----')
    my_txt = ''
    for simbol in s: my_txt += simbol + ' '
    st.text(my_txt)
    st.text('*' * 60)
    # Проверяем списки на наличие методов __iter__ и __getitem__
    list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
    st.text('Исходный список ->  ' + str(list))
    st.text('Поддерживают ли списки итерации ->' + str(hasattr(list, '__iter__')))
    st.text('Поддерживают ли списки порядок следования элементов ->' + str(hasattr(list, '__getitem__')))
    st.text('----- Цикл обхода элементов списка -----')
    my_txt = ''
    for elem in list_1: my_txt += str(elem) + ' '
    st.text(my_txt)
    st.text('*' * 60)
    # Проверяем словари на наличие методов __iter__ и __getitem__
    d = {1: 'Иванов', 2: 'Петров', 3: 'Сидоров'}
    st.text('Исходный словарь ->  ' + str(d))
    st.text('Поддерживают ли словари итерации ->' + str(hasattr(d, '__iter__')))
    st.text('Поддерживают ли словари порядок следования элементов ->' + str(hasattr(d, '__getitem__')))
    # Запускаем цикл для обхода ключей словаря.
    st.text('----- Цикл обхода элементов словаря -----')
    my_txt = ''
    for key in d: my_txt += str(key) + ' '
    st.text(my_txt)
    st.text('*' * 60)
    # Проверяем множество на наличие методов __iter__ и __getitem__
    s = {'Один', 'Два', 'Три', 'Четыре', 'Пять'}
    st.text('Исходное множество ->  ' + str(s))
    st.text('Поддерживают ли множества итерации ->' + str(hasattr(s, '__iter__')))
    st.text('Поддерживают ли множества порядок следования элементов ->' + str(hasattr(s, '__getitem__')))
    st.text('----- Цикл обхода элементов множества -----')
    my_txt = ''
    for elem in s: my_txt += elem + ' '
    st.text(my_txt)

def run_3_31():
    st.markdown('#### 🐍 Использование функции next()')
    list_1 = [1, 2, 3]  # Создаем список
    st.text('Исходный список')
    my_txt = ''
    for e in list_1: my_txt += str(e) + ' '
    st.text(my_txt)  # Выводим элементы списка
    st.text('-' * 60)
    # Получаем объект-итератор из списка посредством функции iter()
    obj_iter = iter(list_1)  # создаем объект-итератор
    st.text('Исходный список в виде объекта obj_iter')
    st.text('obj_iter: '+ str(obj_iter))
    st.text('Элементы obj_iter с помощью функции next(obj_iter)')
    st.text('Элемент списка ->' + str(next(obj_iter)))
    st.text('Элемент списка ->' + str(next(obj_iter)))
    st.text('Элемент списка ->' + str(next(obj_iter)))
    st.text('-' * 60)
    obj_iter = iter(list_1)  # создаем объект-итератор заново
    st.text('Элементы obj_iter с помощью функции next(obj_iter, default)')
    st.text('Элемент списка ->' + str(next(obj_iter, '<- Список закончился ->')))
    st.text('Элемент списка ->' + str(next(obj_iter, '<- Список закончился ->')))
    st.text('Элемент списка ->' + str(next(obj_iter, '<- Список закончился ->')))
    st.text('Элемент списка ->' + str(next(obj_iter, '<- Список закончился ->')))
    st.text('Элемент списка ->' + str(next(obj_iter, '<- Список закончился ->')))
    st.text('Элемент списка ->' + str(next(obj_iter, '<- Список закончился ->')))

def run_3_32():
    st.markdown('#### 🐍 Сравнение способов итераций (в цикле и ручной)')
    li = [1, 2, 3]  # Создаем список
    txt = []
    for e in li: txt.append(e)
    st.text(str(txt))  # Получаем элементы списка в авто режиме
    st.text('-----------')
    # Используем протокол итераций и
    # получаем элементы списка в ручном режиме
    li_iter = iter(li)
    st.text(str(next(li_iter)))
    st.text(str(next(li_iter)))
    st.text(str(next(li_iter)))
    st.text(str(next(li_iter, 'Конец списка')))

def run_3_33():
    st.markdown('#### 🐍 Объем памяти для хранения итерируемого объекта и итератора')
    import sys  # Импортируем модуль sys
    list_1 = list(range(0, 100))  # Создадим список 100 элементов
    iter_list = iter(list_1)  # Получаем итератор списка
    # Выводим размеры списка и его итератора
    st.text('Размер списка 100 элементов:' + str(sys.getsizeof(list_1)))
    st.text('Размер итератора этого списка:' + str(sys.getsizeof(iter_list)))
    st.text('-----------------------------------------')
    list_1 = list(range(0, 100000))  # Создадим список 1 000 000 элементов
    iter_list = iter(list_1)  # Получаем итератор списка
    # Выводим размеры списка и его итератора
    st.text('Размер списка 1 000 000 элементов:' + str(sys.getsizeof(list_1)))
    st.text('Размер итератора этого списка:' + str(sys.getsizeof(iter_list)))

def run_3_34():
    st.markdown('#### 🐍 Возможность итераций для файловых объектов и списков')
    import os
    # Удаляем текстовый файл (если он ранее был создан)
    if os.path.isfile('text_file.txt'):
        os.remove('text_file.txt')
    # Создаем пустой текстовый файл
    my_file = open("text_file.txt", "a+", encoding='utf-8')
    # Записываем в текстовый файл две строки
    my_file.write("Это первая строка текстового файла" + '\n')
    my_file.write("А это вторая строка")
    my_file.close()  # закрываем текстовый файл
    #  Создаем объект и помещаем в него текстовый файл
    obj_file = open('text_file.txt', encoding='utf-8')
    st.text('К элементам файлового объекта можно обращаться напрямую (итератор встроен)')
    st.text(str(obj_file.__next__()))  # Выведет первую строку
    st.text(str(obj_file.__next__()))  # Выведет вторую строку
    st.text('-' * 30)
    list_1 = ['Иванов', 'Петров']  # создаем список
    # У списков нет встроенных итераторов
    # поэтому следующая строка сгенерирует ошибку
    # print(list_1.__next__())
    obj_iter = list_1.__iter__()  # создаем итератор для list_1
    st.text('У списков нет встроенного итератора')
    st.text('Но для них можно создать объект - итератор')
    st.text('Через который можно получить доступ к элементам списка')
    st.text('Первый элемент списка ->' + str(obj_iter.__next__()))
    st.text('Второй элемент списка ->' + str(obj_iter.__next__()))
    if os.path.isfile('text_file.txt'):
        os.remove('text_file.txt')

def run_3_35():
    st.markdown('#### 🐍 Пример использования генератора-выражения')
    # Выражение-генератор без условия
    gen_1 = (x ** 2 for x in range(2, 6))
    st.text('Это объект-генератор (gen_1)')
    st.text(gen_1)
    st.text('Это значения, выдаваемые генератором gen_1')
    txt = []
    for elem in gen_1:
        txt.append(elem)
    st.text(txt)
    st.text('-' * 30)
    # Выражение-генератор с условием if
    gen_2 = (x * 10 for x in range(2, 10) if x > 4)
    st.text('Это объект-генератор (gen_2)')
    st.text(gen_2)
    st.text('Это значения, выдаваемые генератором gen_2')
    txt = []
    for elem in gen_2:
        txt.append(elem)
    st.text(txt)
def run_3_36():
    st.markdown('#### 🐍 Генераторы (оценка объема памяти)')
    import sys
    # Генератор создает список
    li_1 = [x for x in range(0, 1000000)]
    st.text('Размер памяти, занятой списком li_1: ' + str(sys.getsizeof(li_1)))
    # Генератор создает множество
    s_1 = {x for x in range(0, 1000000)}
    st.text('Размер памяти, занятой множеством s_1: ' + str(sys.getsizeof(s_1)))
    # Генератор-выражение создает итератор
    gen_1 = (x for x in range(0, 1000000))
    st.text('Размер памяти, занятой итератором gen_1: ' + str(sys.getsizeof(gen_1)))
    rem_s1 = sys.getsizeof(s_1)
    rem_g1 = sys.getsizeof(gen_1)
    rez = rem_s1 / rem_g1
    st.text('Сокращение объема памяти - ' + str(rez))

def run_3_37():
    st.markdown('#### 🐍 Функции конструкторы для списков, кортежей и множеств')
    # Создаем список при помощи функции list()
    list_1 = list(x for x in range(10))
    st.text('Список list_1: ' + str(list_1))
    # Создаем кортеж при помощи функции tuple()
    tup_1 = tuple(x for x in range(10))
    st.text('Кортеж tup_1: ' + str(tup_1))
    # Создаем множество при помощи функции set()
    set_1 = set((x for x in range(10)))
    st.text('Множество s_1: ' + str(set_1))

def run_3_38():
    st.markdown('#### 🐍 Генерация словарей из кортежей')
    # Источник ключей и значений для словаря в виде списка кортежей
    list_1 = [('Один', 1), ('Два', 2), ('Три', 3)]
    st.text('Источник для словаря в виде списка кортежей')
    st.text('list_1 ->' + str(list_1))
    st.text('Простой генератор словаря')
    d_1 = {k: v for k, v in list_1}
    st.text('d_1 ->' + str(d_1))
    st.text('Генератор словаря с условием')
    d_2 = {k: v for k, v in list_1 if v != 3}
    st.text('d_2 ->' + str(d_2))
    st.text('Словарь из выражения-генератора и списка кортежей')
    d_3 = dict(((k, v) for k, v in list_1))
    st.text('d_3 ->' + str(d_3))
    st.text('Словарь со значением по умолчанию')
    d_4 = {k: None for k in 'ABC'}
    st.text('d_4 ->' + str(d_4))
    st.text('-' * 50)
    # Источник ключей и значений для словаря из вложенного кортежа
    tup_1 = (('Один', 1), ('Два', 2), ('Три', 3))
    st.text('Источник для словаря вложенный кортеж')
    st.text('tup_1 ->' + str(tup_1))
    st.text('Словарь из выражения-генератора и вложенного кортежа')
    d_5 = dict(((k, v) for k, v in tup_1))
    st.text('d_5 ->' + str(d_5))

def run_3_39():
    st.markdown('#### 🐍 Пример работы функции-генератора')
    # Обычная функция Python
    def list_func(n):
        list_1 = []  # Пустой список
        for i in range(1, n + 1):  # Запускаем цикл
            list_1.append(i)  # Добавляем элемент в список
        return list_1  # Возвращаем готовый список
    my_list = list_func(3)
    st.text('Объект list_func ->' + str(list_func))
    st.text('Список из обычной функции list_func(3) ->' + str(my_list))
    # Функция-генератор возвращает объект-генератор со встроенным итератором
    def gen_func(n):
        for i in range(1, n + 1):  # Запускаем цикл
            yield i  # Возвращаем значение и приостанавливаем работу
    st.text('Объект gen_func ->' + str(gen_func))
    g_iter_1 = gen_func(2)  # Генератор для формирования 2-х значений с итератором
    g_iter_2 = gen_func(3)  # Генератор для формирования 3-х значений с итератором
    st.text('Многократное обращение к функции-генератору через g_iter_1')
    st.text('1-е обращение к g_iter_1:'+ str(next(g_iter_1, 'Пусто')))
    st.text('2-е обращение к g_iter_1:'+ str(next(g_iter_1, 'Пусто')))
    st.text('3-е обращение к g_iter_1:'+ str(next(g_iter_1, 'Пусто')))
    st.text('------------------------------------------------')
    st.text('Многократное обращение к функции-генератору через g_iter_2')
    st.text('1-е обращение к g_iter_2:'+ str(next(g_iter_2, 'Пусто')))
    st.text('2-е обращение к g_iter_2:'+ str(next(g_iter_2, 'Пусто')))
    st.text('3-е обращение к g_iter_2:'+ str(next(g_iter_2, 'Пусто')))
    st.text('4-е обращение к g_iter_2:'+ str(next(g_iter_2, 'Пусто')))

def run_3_40():
    st.markdown('#### 🐍 Обработка исключений: try, except и finally')
    x = 0
    try:
        y = 100 / x
        st.text('y ='+ str(y))
    except ValueError:
        st.text("Это не число!")
    except ZeroDivisionError:
        st.text("На ноль делить нельзя!")
    except TypeError:
        st.text("Неожиданная ошибка")
    else:
        st.text("Код выполнился без ошибок")
    finally:
        st.text("Я выполняюсь в любом случае! " + 'x = '+ str(x))
        st.text('-' * 40)
    x = 'Это строка символов'
    try:
        y = 100 / x
        print('y ='+ str(y))
    except ValueError:
        st.text("Это не число!")
    except ZeroDivisionError:
        st.text("На ноль делить нельзя!")
    except TypeError:
        st.text("Неожиданная ошибка")
    else:
        st.text("Код выполнился без ошибок")
    finally:
        st.text("Я выполняюсь в любом случае! " + 'x ='+ str(x))
        st.text('-' * 40)
    x = 10
    try:
        y = 100 / x
        st.text('y ='+ str(y))
    except ValueError:
        st.text("Это не число!")
    except ZeroDivisionError:
        st.text("На ноль делить нельзя!")
    except TypeError:
        st.text("Неожиданная ошибка.")
    else:
        st.text("Код выполнился без ошибок")
    finally:
        st.text("Я выполняюсь в любом случае! " + 'x = '+ str(x))

def run_3_41():
    st.markdown('#### 🐍 Функции open и write для работы с файлами')
    import os
    text = 'Это первая строка текста\nЭто вторая строка текста\nЭто третья строка текста\n'
    file_txt = open('my_file.txt', 'w')
    file_txt.write(text)
    file_txt.close()
    # Получить информацию о файле
    my_file = open("my_file.txt")
    st.text(my_file)
    if os.path.isfile('my_file.txt'):
        os.remove('my_file.txt')

def run_3_42():
    st.markdown('#### 🐍 Инструкция «with...as» для открытия файла')
    import os
    text = 'Это первая строка текста\nЭто вторая строка текста\nЭто третья строка текста\n'
    with open('my_file.txt', 'w', encoding="utf-8") as file_txt:
        file_txt.write(text)
    # Получить информацию о файле
    my_file = open("my_file.txt")
    st.text(my_file)
    if os.path.isfile('my_file.txt'):
        os.remove('my_file.txt')

def run_3_43():
    st.markdown('#### 🐍 Запись и чтение данных из файла')
    import os
    text = 'Это первая строка текста\nЭто вторая строка текста\nЭто третья строка текста\n'
    with open('my_file.txt', 'w', encoding="utf-8") as file_txt:
        file_txt.write(text)
    with open('my_file.txt', 'r') as file_txt:
        data_text = file_txt.read()
    # Получить информацию о файле
    st.text(file_txt)
    st.text('-' * 65)
    # Вывести содержимое файл построчно
    for line in data_text.splitlines():
        st.text(line)
    if os.path.isfile('my_file.txt'):
        os.remove('my_file.txt')

def run_3_44():
    st.markdown('#### 🐍 Запись и чтение данных из файла')
    import os
    # Запись информации в файл
    text = 'Это первая строка текста\nВ этом программном модуле\nиспользуется кодировка UTF-8\n'
    with open('my_file.txt', 'w', encoding="utf-8") as file_txt:
        file_txt.write(text)
    # Чтение информации из файла
    with open('my_file.txt', 'r', encoding="utf-8") as file_txt:
        data_text = file_txt.read()
    # Получить информацию о файле
    st.text(file_txt)
    st.text('-' * 30)
    st.text(data_text)  # Вывести содержимое файл
    st.text('-' * 30)
    # Вывести содержимое файл
    for line in data_text.splitlines():
        st.text(line)
    if os.path.isfile('my_file.txt'):
        os.remove('my_file.txt')

def run_3_45():
    st.markdown('#### 🐍 Функция input() для ввода данных')
    # Строковое значение
    # text_1 = input('Ведите любой текст:')
    text_1 = st.text_input(label="Ведите любой текст:")
    if text_1:
        st.text(text_1)
    st.text('Тип объекта text_1:' + str(type(text_1)))
    # Целое число
    num_1 = st.number_input('Ведите целое число:')
    if num_1:
        st.text(num_1)
    st.text('Тип объекта num_1 после ввода:' + str(type(num_1)))
    num_1 = int(num_1)
    st.text('Тип объекта num_1 после преобразования в целое :'+ str(type(num_1)))
    # Вещественное число
    num_2 = st.number_input('Ведите число с десятичной точкой:')
    if num_2:
        st.text(num_2)
    st.text('Тип объекта num_1 после ввода:' + str(type(num_2)))
    st.text(num_2)
    st.text('Тип объекта num_2 после ввода:'+ str(type(num_2)))
    num_2 = float(num_2)
    st.text('Тип объекта num_2 после преобразования :'+ str(type(num_2)))

def run_3_46():
    st.markdown('#### 🐍 Функция input() с инструкцией «try: except»')
    st.markdown('###### Скопируйте данный код в буфер обмена')
    st.markdown('###### и выполните в редакторе кода Python')

def run_3_47():
    st.markdown('#### 🐍 Функция print() для вывода данных')
    st.markdown('###### Скопируйте данный код в буфер обмена')
    st.markdown('###### и выполните в редакторе кода Python')

def run_3_48():
    st.markdown('#### 🐍 Задание путей к файлам в Python')
    st.markdown('###### Скопируйте данный код в буфер обмена')
    st.markdown('###### и выполните в редакторе кода Python')

if __name__ == '__main__':
    run_3_1()