import streamlit as st

def run_4_1():
    st.markdown('#### 🐍 Объявление и вызов функции в Python')
    def my_fun(a, b):
        c = a + b
        return c
    d = my_fun(10, 20)  # вызов функции
    st.text('d =' + str(d))

def run_4_2():
    st.markdown('#### 🐍 Многократный вызов функции')
    def my_fun(x, y):
        c = x + y
        return c
    a = my_fun(1, 2)  # вызов функции
    st.text('a = ' + str(a))
    a = 100
    b = 200
    k = my_fun(a, b)  # вызов функции
    st.text('k = ' + str(k))
    m = 50
    n = 60
    d = my_fun(m, n)  # вызов функции
    st.text('d = ' + str(d))

def run_4_3():
    st.markdown('#### 🐍 Варианты передачи аргументов в функцию')
    def my_func(x=20, y=10):
        rez = x - y
        return rez
    res_1 = my_func()  # Аргументы не заданы
    st.text('Аргументы не заданы: res_1 =' + str(res_1))
    res_2 = my_func(40)  # В функцию передан один аргумент
    st.text('Передан 1 аргумент (20): res_2 =' + str(res_2))
    res_3 = my_func(200, 100)  # В функцию передано два аргумента
    st.text('Передано 2 аргумента (200, 100): res_3 =' + str(res_3))
    res_4 = my_func(x=100, y=500)
    st.text('Переданы именованные аргументы (x=100, y=500): res_4 =' + str(res_4))
    # Явно указываем имена аргументов, поэтому порядок не важен
    res_5 = my_func(y=500, x=100)
    st.text('Переданы именованные аргументы (y=500, x=100): res_5 =' + str(res_5))

def run_4_4():
    st.markdown('#### 🐍 Однострочная функция')
    def func_1(a, b, c): return a + b + c
    x = 1
    y = 2
    z = 3
    rez1 = func_1(x, y, z)
    st.text('Аргументы числа, rez1 = ' + str(rez1))
    x = 'Иванов '
    y = 'Семен '
    z = 'Петрович'
    rez2 = func_1(x, y, z)
    st.text('Аргументы символы, rez2 = ' + str(rez2))

def run_4_5():
    st.markdown('#### 🐍 Функция с разными вариантами позиционирования аргументов')
    st.text('Функция с тремя позиционными параметрами def func(x, y, z):')
    def func(x, y, z):
        rez = x + y - z
        return rez
    st.text('-' * 60)
    st.text('Вызов функции с разными вариантами позиционирования аргументов')
    st.text('func(8, 2, 5) Результат -> ' + str(func(8, 2, 5)))
    st.text('func(x=8, y=2, z=5) Результат -> ' + str(func(x=8, y=2, z=5)))
    st.text('func(y=2, x=8, z=5) Результат -> ' + str(func(y=2, x=8, z=5)))
    st.text('func(z=5, x=8, y=2) Результат -> ' + str(func(z=5, x=8, y=2)))
    st.text('func(8, y=2, z=5) Результат -> ' + str(func(8, y=2, z=5)))
    st.text('func(8, z=5, y=2) Результат -> ' + str(func(8, z=5, y=2)))
    st.text('func(8, 2, z=5) Результат -> ' + str(func(8, 2, z=5)))

def run_4_6():
    st.markdown('#### 🐍 Функция с одним позиционными параметром')
    st.text('Функция с одним позиционными параметром def func(x, y=1):')
    def func(x, y=1):
        rez = x / y
        return rez
    st.text('-' * 60)
    st.text('Вызов функции с разными вариантами передачи аргументов')
    st.text('func(8, 2) Результат -> ' + str(func(8, 2)))
    st.text('func(x=8, y=2) Результат -> ' + str(func(x=8, y=2)))
    st.text('func(8, y=2) Результат -> ' + str(func(8, y=2)))
    st.text('func(2) Результат -> ' + str(func(2)))
    st.text('func(x=2) Результат -> ' + str(func(x=2)))

def run_4_7():
    st.markdown('#### 🐍 Функции с приемом переменного количества аргументов')
    st.text('Функция с фиксированным количеством параметров - def my_fun_1(x, y):')
    def my_fun_1(x, y):
        st.text('Тип переменной y ->' + str(type(y)))
        rez = x + y
        return rez
    rez_1 = my_fun_1(1, 2)
    st.text('Результат my_fun_1(1, 2) -> ' + str(rez_1))
    st.text('Функция с одним из параметров переменной длины - def my_fun_1(x, *y):')
    def my_fun_2(x, *y):
        st.text('Тип переменной y ->' + str(type(y)))
        rez = x + sum(y)
        return rez
    rez_2 = my_fun_2(1, 2, 3)
    st.text('Результат my_fun_2(1, 2, 3) -> ' + str(rez_2))
    st.text('Функция с параметром переменной длины - my_fun_3(*args):')
    def my_fun_3(*args):
        rez = sum(args)
        return rez
    st.text('Результат my_fun_3() -> ' + str(my_fun_3()))
    st.text('Результат my_fun_3(1) -> ' + str(my_fun_3(1)))
    st.text('Результат my_fun_3(1, 2) -> ' + str(my_fun_3(1, 2)))
    st.text('Результат my_fun_3(1, 2, 3) -> ' + str(my_fun_3(1, 2, 3)))
    st.text('Результат my_fun_3(1, 2, 3, 4) -> ' + str(my_fun_3(1, 2, 3, 4)))

def run_4_8():
    st.markdown('#### 🐍 Функция с позиционными и не именованными аргументами')
    st.text('Функция с параметром, принимающим кортеж def func(x, *tup):')
    def func(x, *tup):
        rez = x + sum(tup)
        return rez
    st.text('-' * 60)
    st.text('Вызов функции с разными вариантами передачи аргументов')
    st.text('func(5) Результат -> ' + str(func(5)))
    st.text('func(5, 10) Результат -> ' + str(func(5, 10)))
    st.text('func(5, 10, 15, 20, 30) Результат -> ' + str(func(5, 10, 15, 20, 30)))

def run_4_9():
    st.markdown('#### 🐍 Функция с кортежем в середине списка параметров')
    st.text('Функция с параметром кортеж в середине списка параметров def func(x, *y, z):')
    def func(x, *y, z):
        rez = x + sum(y) + z
        return rez
    st.text('-' * 60)
    st.text('Вызов функции с разными вариантами передачи аргументов')
    st.text('func(5, 7, 8, z=3) Результат -> ' + str(func(5, 7, 8, z=3)))
    st.text('func(5, 6, 7, 8, 9, z=3) Результат -> ' + str(func(5, 6, 7, 8, 9, z=3)))
    st.text('func(5, z=3) Результат -> ' + str(func(5, z=3)))
    def func_1(x, *, z):
        rez = x + sum(y) + z
        return rez
    st.text('func(5, 6, 7, 8, 9, z=3) Результат -> ' + str(func(5, 6, 7, 8, 9, z=3)))
    st.text('func(5, z=3) Результат -> ' + str(func(5, z=3)))

def run_4_10():
    st.markdown('#### 🐍 Функция с использованием инструкции «**kwargs»')
    def my_fun(**data):
        st.text("Тип данных ->"+ str(type(data)))
        st.text('--------- Получен следующий словарь ---------')
        st.text(data)
        st.text('-' * 60)
        st.text('       Вывод содержания словаря')
        for key, value in data.items():
            st.text(str(key) + ': ' + str(value))
    st.text('######## Это первое обращение к функции ##############')
    my_fun(Фамилия="Иванов", Имя="Петр", Возраст=22)

    st.text('######## Это второе обращение к функции ##############')
    my_fun(Имя="Виктор", Фамилия="Семенов",
           Email="vik_123@nomail.com", Страна="Россия", Возраст=25)

def run_4_11():
    st.markdown('#### 🐍 Операторы «*» и «**» при вызове функций')
    st.text('Функция с наличием звездочек в параметрах def func_1(*x, **y):')
    def func_1(*x, **y):
        st.text('x -> ' + str(x))
        st.text('y -> ' + str(y))
        return
    st.text('Обращение к функции func_1')
    func_1(1, 2, 3, 4, Сотрудник='Иванов А.В.', Должность='Программист')
    st.text('-' * 60)
    st.text('Функция с обычными парами def func_2(x, y):')
    def func_2(x, y):
        st.text('x -> ' + str(x))
        st.text('y -> ' + str(y))
        return
    st.text('Первое обращение к функции func_2')
    func_2(*[111, 222])
    st.text('-' * 60)
    st.text('Второе обращение к функции func_2')
    func_2(**{'x': 'Иванов', 'y': 'Петров'})

def run_4_12():
    st.markdown('#### 🐍 Функции с комбинированными параметрами')
    def func(x, *y, **z):
        st.text("Тип данных x -> " + str(type(x)))
        st.text('x-> ' + str(x))
        st.text("Тип данных y -> " + str(type(y)))
        st.text('y-> ' + str(y))
        st.text("Тип данных z -> " + str(type(z)))
        st.text('z-> ' + str(z))
        return
    func(111, 222, 333, y=1, a=2, b=3)

def run_4_13():
    st.markdown('#### 🐍 Области видимости переменных в Python')
    glob_var_0 = 0.001
    st.text('Задано в начале модуля: glob_var_0 = ' + str(glob_var_0))
    st.text('-' * 45)
    def func_1(par_1):  # Объявляем внешнюю функцию
        # Это тело func_1, объявляем локальную переменную
        loc_var_1 = 111
        st.text('Задано в функции func_1: loc_var_1 = ' + str(loc_var_1))
        # Это тело func_1, выводим доступные переменные
        st.text('Доступно в функции func_1: glob_var_0 -> ' + str(glob_var_0))
        st.text('Доступно в функции func_1: par_1 -> ' + str(par_1))
        st.text('-' * 45)
        def func_2():  # Объявляем вложенную функцию
            # Это тело func_2, объявляем локальную переменную
            loc_var_2 = 222
            st.text('Задано в функции func_1: loc_var_2 = ' + str(loc_var_2))
            # Это тело func_2, выводим доступные переменные
            st.text('Доступно в функции func_2: glob_var_0 -> ' + str(glob_var_0))
            st.text('Доступно в функции func_2: loc_var_1 -> ' + str(loc_var_1))
            st.text('Доступно в функции func_2: par_1 -> ' + str(par_1))
            st.text('-' * 45)
            return  # Конец тела func_2
        # Продолжение тела func_1
        func_2()  # Вызываем вложенную функцию
        return  # Конец тела func_1
    # Это продолжение тела основного модуля
    func_1('Аргумент')  # Вызываем внешнюю функцию
    st.text('Доступно в основном модуле: glob_var_0 -> ' + str(glob_var_0))

def run_4_14():
    st.markdown('#### 🐍 Использование одинаковых имен в базовом модуле и функциях')
    var = 0.001
    st.text('В начале программного модуля: var = '+ str(var))
    # Объявляем 1-ю функцию
    def func_1():
        var = 111
        st.text('В функции func_1: var = '+ str(var))
        return
    # Объявляем 2-ю функцию
    def func_2():
        var = 222
        st.text('В функции func_2: var = ' + str(var))
        return
    # Это продолжение тела основного модуля
    func_1()  # Вызываем функции func_1
    func_2()  # Вызываем функции func_2
    st.text('В конце программного модуля: var = '+ str(var))

def run_4_15():
    st.markdown('#### 🐍 Использование инструкций «global» и «nonlocal»')
    Glob_var = 0.001
    st.text('     Начало работы основного модуля')
    st.text('Значение Glob_var в начале модуля: Glob_var = ' + str(Glob_var))
    st.text('-' * 50)
    def func_1():  # Объявляем внешнюю функцию
        # Начало тела внешней функции
        st.text('     Начало работы функции func_1()')
        # Glob_var = 100  # Так нельзя- получим ошибку
        global Glob_var  # Даем возможность менять Glob_var в func_1 и func_2
        # Теперь можно изменять значение Glob_var
        # в функциях func_1 и func_2
        Glob_var = 100
        st.text('Значение Glob_var в func_1: Glob_var = ' + str(Glob_var))
        Loc_var = 11111  # Создаем локальную переменную в func_1
        st.text('Значение в func_1: Loc_var= ' + str(Loc_var))
        def func_2():  # Объявляем вложенную функцию
            # Тело вложенной функции
            st.text('     Начало работы функции func_2()')
            Glob_var = 200
            st.text('Значение Glob_var в func_2: Glob_var = ' + str(Glob_var))
            # Loc_var = 222  # Так нельзя- получим ошибку
            nonlocal Loc_var  # Даем возможность менять Loc_var в func_2
            Loc_var = 22222  # Изменяем значение loc_var
            st.text('Значение Loc_var в func_2: Loc_var = ' + str(Loc_var))
            st.text('-' * 50)
            return
        # Продолжение тела внешней функции
        func_2()  # Вызываем вложенную функцию func_2
        st.text('     Продолжение работы функции func_1()')
        st.text('Значение Glob_var по выходу из func_2: Glob_var = ' + str(Glob_var))
        st.text('Значение Loc_var по выходу func_2: Loc_var = ' + str(Loc_var))
        st.text('-' * 50)
        return
    func_1()  # Вызываем внешнюю функцию
    st.text('     Завершение работы основного модуля ')
    st.text('Значение Glob_var в конце модуля: Glob_var = ' + str(Glob_var))

def run_4_16():
    st.markdown('#### 🐍 Встроенные функции globals() и locals()')
    glob_var_1 = 0.1  # Инициализируем 1-ю глобальную переменную
    # Объявляем внешнюю функцию
    def func_1():
        loc_var_1 = 1  # Локальная переменная для func_1
        st.text('    Это печать из внешней функции - func_1')
        st.text('Словарь доступных локальных переменных для func_1')
        st.text(str(locals()))
        st.text('Словарь глобальных переменных')
        st.text(str(globals()))
        st.text('-' * 60)
        # Объявляем вложенную функцию
        def func_2():
            loc_var_2 = 2  # Локальная переменная для func_2
            st.text('    Это печать из вложенной функции - func_2')
            st.text('Локальные переменные для func_2 -> ' + str(locals()))
            st.text('-' * 60)
            return
        func_2()  # Вызываем вложенную функцию func_2.
        return
    func_1()  # Вызываем функцию -func_1()
    # Словарь глобальных переменных
    st.text('    Это печать из основного модуля')
    st.text('Словарь глобальных переменных')
    st.text(str(globals()))
    st.text('Словарь локальных переменных')
    st.text(str(locals()))
    st.text('-' * 60)
    glob_var_2 = 0.2  # Инициализируем 2-ю глобальную переменную
    st.text('Обновленный словарь глобальных переменных')
    st.text(str(globals()))

def run_4_17():
    st.markdown('#### 🐍 lambda-выражения или анонимные функции')
    def my_func(x, y, z):
        rez = x + y + z
        return rez
    sum_0 = my_func(5, 10, 15)
    st.text('Результат sum_0-> ' + str(sum_0))
    # lambda функция
    # явно присваиваем его переменной
    lambda_1 = lambda x, y, z: x + y + z
    sum_1 = lambda_1(5, 10, 15)
    st.text('Результат sum_1-> ' + str(sum_1))
    # Используем значения по умолчанию
    lambda_2 = lambda x=8, y=4: x / y
    rez_2 = lambda_2()
    rez_3 = lambda_2(12)
    st.text('rez_2 = ' + str(rez_2))
    st.text('rez_3 = ' + str(rez_3))
    # Собираем аргументы в кортеж
    lambda_3 = lambda *nums: sum(nums)
    sum_2 = lambda_3(2, 3)
    sum_3 = lambda_3(1, 2, 3, 4, 6, 6)
    st.text('sum_2 = ' + str(sum_2))
    st.text('sum_3 = ' + str(sum_3))
    # Используем простейшую логику
    lambda_4 = lambda x, y: x / y if y != 0 else None
    log_1 = lambda_4(20, 5)
    log_2 = lambda_4(20, 0)
    st.text('log_1 = ' + str(log_1))
    st.text('log_2 = ' + str(log_2))

def run_4_18():
    st.markdown('#### 🐍 Различные варианты использования lambda-выражений')
    st.text('lambda-функция с одним аргументом')
    f1 = lambda x: x * x + x ** 3 - x / 2
    rez = (22 + f1(2)) / 2 + f1(3) - f1(4)
    st.text('rez = ' + str(rez))
    st.text('-' * 15)
    st.text('lambda-функция с двумя аргументами')
    f2 = lambda x, y: x ** y - x + (x * y) / 2 + y / x
    st.text('f2 = ' + str(f2(5, 3)))
    st.text('f2 = ' + str(f2(8, 2)))
    st.text('-' * 15)
    st.text('Список из двух lambda-функций')
    list_2 = [lambda x: x ** 2, lambda x: x ** 3]
    st.text('list_2 = ' + str(list_2[0](3)))
    st.text('list_2 = ' + str(list_2[1](3)))
    st.text('-' * 15)
    st.text('И lambda-функция, и ее аргументы внутри выражения')
    rez_1 = 5 + (lambda x, y: x ** y)(5, 2) - 15
    st.text('rez_1 = ' + str(rez_1))
    st.text('-' * 15)
    st.text('lambda-выражение c вложенным lambda-выражением')
    rez_2 = (lambda x: 7 + (lambda a, b: a ** b)(x, 2))(5)
    st.text(str(rez_2))

def run_4_19():
    st.markdown('#### 🐍 Рекурсивные функции')
    def sum_n(n):
        if n == 0:
            return n
        else:
            return n + sum_n(n - 1)
    st.text('Сумма чисел - 0 -> ' + str(sum_n(0)))
    st.text('Сумма чисел от 0 до 1 -> ' + str(sum_n(1)))
    st.text('Сумма чисел от 0 до 2 -> ' + str(sum_n(2)))
    st.text('Сумма чисел от 0 до 3 -> ' + str(sum_n(3)))
    st.text('Сумма чисел от 0 до 10 -> ' + str(sum_n(10)))
    st.text('Сумма чисел от 0 до 20 -> ' + str(sum_n(20)))

def run_4_20():
    st.markdown('#### 🐍 Вывод параметра цикла рекурсивной функции')
    def sum_n(n):
        st.text('n = ' + str(n))
        if n == 0:
            return n
        else:
            return n + sum_n(n - 1)
    st.text('Сумма чисел от 0 до 4 -> ' + str(sum_n(4)))

def run_4_21():
    st.markdown('#### 🐍 Атрибуты функций')
    def func(n):
        st.text('Итог вычисления n**2 = ' + str(n ** 2))
        func.count += 1
        return
    st.text('Тип объекта: ' + str(func))
    st.text('Все встроенные атрибуты функции')
    st.text(str(dir(func)))
    st.text('-' * 30)
    st.text('Имя функции: ' + str(func.__name__))
    st.text('Размер функции в байтах: ' + str(func.__sizeof__()))
    st.text('-' * 30)
    # Создаем свой атрибут
    func.count = 0
    st.text('Начальное значение пользовательского атрибута count -> ' + str(func.count))
    # Используем пользовательский атрибут
    func(2)
    # вывод значения атрибута
    st.text('Количество обращений к функции count -> ' + str(func.count))
    st.text('-' * 30)
    func(4)
    # вывод значения атрибута
    st.text('Количество обращений к функции count -> ' + str(func.count))
    st.text('-' * 30)
    func(6)
    # вывод значения атрибута
    st.text('Количество обращений к функции count -> ' + str(func.count))

def run_4_22():
    st.markdown('#### 🐍 Аннотирование и документирование функций')
    def my_func(name: 'Это имя', age: int) -> str:
        """Это функция "my_func", она формирует nic пользователя"""
        nick = name + '_' + str(age)  # Составляем ник пользователя
        return nick  # Возвращаем ник пользователя
    st.text('Обращаемся к функции')
    st.text(str(my_func('Иванов_Петр', 35)))
    st.text('----- Получаем сведения о параметрах функции -----')
    st.text(str(my_func.__doc__))
    st.text(str(my_func.__annotations__))

def run_4_23():
    st.markdown('#### 🐍 Аннотируемая функция со значением аргументов по умолчанию')
    def my_func(cena: 'Цена - руб', nalog: 'Налог -%' = 20) -> float:
        nds = cena * nalog / (100 + nalog)
        tovar = cena - nds
        return tovar, nds
    st.text('      Получаем сведения о параметрах функции')
    st.text(str(my_func.__annotations__))
    st.text('-' * 60)
    cena = 200  # цена товара с НДС
    st.text('Цена товара с НДС - ' + str(cena))
    st.text('-' * 30)
    st.text('     Расчет при ставке НДС 20%')
    tovar, nds = my_func(cena)
    itogo = round(tovar, 2) + round(nds, 2)
    st.text('Стоимость товара - ' + str(round(tovar, 2)))
    st.text('НДС от стоимость товара - ' + str(round(nds, 2)))
    st.text('Итого - ' + str(itogo))
    st.text('-' * 30)
    st.text('     Расчет при ставке НДС 10%')
    tovar, nds = my_func(cena, 10)
    itogo = round(tovar, 2) + round(nds, 2)
    st.text('Стоимость товара - ' + str(round(tovar, 2)))
    st.text('НДС от стоимость товара - ' + str(round(nds, 2)))
    st.text('Итого - ' + str(itogo))

def run_4_24():
    st.markdown('#### 🐍 Две независимые функции без декоратора')
    def base_func():
        st.text("Это отработал код базовой функции (он не меняется никогда)")
        return
    base_func()  # Вызов базовой функции
    st.text('-' * 60)
    # Это новая функция
    def new_func():
        st.text("Это отработал код, добавленный перед базовой функцией - base_func()")
        st.text("Это отработал код базовой функции (он не меняется никогда)")
        st.text("Это отработал код, добавленный после базовой функции - base_func()")
        return
    new_func()  # Вызов новой функции

def run_4_25():
    st.markdown('#### 🐍 Базовая функция и функция декоратор')
    def base_func():
        st.text("Это отработал код базовой функции (он не меняется никогда)")
    # Это функция декоратор
    def fun_decor(par_base_func):  # Сюда принимаем базовую функцию
        def wrap_func():  # это функция - обертка для принятой функции
            st.text("Это отработал код, добавленный перед базовой функцией - base_func()")
            par_base_func()  # Здесь выполняется код базовой функции
            st.text("Это отработал код, добавленный после базовой функции - base_func()")
        return wrap_func  # Возвращается результат работы двух функций
    base_func()  # Вызов базовой функции
    st.text('-' * 60)
    # Создаем новый объект - функцию
    new_func = fun_decor(base_func)  # Функции декоратору передаем имя базовой функции
    new_func()  # Вызов новой функции
    st.text('-' * 60)
    base_func()  # Повторный вызов базовой функции

def run_4_26():
    st.markdown('#### 🐍 Использование символа @ для декорирования функций')
    def fun_decor(par_base_func):  # Сюда принимаем базовую функцию
        def wrap_func():  # это функция - обертка для принятой функции
            st.text("Это отработал код, добавленный перед базовой функцией")
            par_base_func()  # Здесь выполняется код базовой функции
            st.text("Это отработал код, добавленный после базовой функции")
        return wrap_func  # Возвращается результат работы двух функций
    # Это обычная функция
    def base_func():
        st.text("Это инструкция из base_func")
    base_func()  # Первый вызов базовой функции
    st.text('-' * 60)
    # Это та же функция, имеющая декоратор с обновлениями
    @fun_decor
    def base_func():
        st.text("Это инструкция из base_func")
    base_func()  # Второй вызов базовой функции

def run_4_27():
    st.markdown('#### 🐍 Многократное использование функции декоратора')
    def fun_decor(par_base_func):  # Сюда принимаем базовую функцию
        def wrap_func():  # это функция - обертка для принятой функции
            st.text("Это отработал код, добавленный перед базовой функцией")
            par_base_func()  # Здесь выполняется код базовой функции
            st.text("Это отработал код, добавленный после базовой функции")
        return wrap_func  # Возвращается результат работы двух функций
    @fun_decor
    def func_1():
        st.text("111111 Это инструкция из func_1 1111111")
    func_1()  # Повторный вызов базовой функции
    print('-' * 60)
    @fun_decor
    def func_2():
        st.text("222222 Это инструкция из func_2 22222")
    func_2()  # Повторный вызов базовой функции
    st.text('-' * 60)
    @fun_decor
    def func_3():
        st.text("333333 Это инструкция из func_3 333333")
    func_3()  # Повторный вызов базовой функции

if __name__ == '__main__':
    run_4_1()