# https://python-code-online.pages.dev/ru/
import streamlit as st
import fun_g2

# Настройка параметров данной страницы
st.set_page_config(
    page_title="Глава 2", # Текст на вкладке браузера
    page_icon='📕',       # Иконка на вкладке браузера
    layout="wide",        # Использовать всю ширину страницы
    initial_sidebar_state="auto",  # Развернуть боковую панель
)

# Текст по центру страницы
st.header("👩🏻‍💻Листинги главы 2")

# Боковая панель
with st.sidebar:
    # Контейнер
    cont_1 = st.container(width=300)

# Контейнер
with cont_1:
    # Раскрывающийся список
    options = st.selectbox("Листинги главы 2",
        ("Листинг 2.1", "Листинг 2.2", "Листинг 2.3", "Листинг 2.4",
         "Листинг 2.5", "Листинг 2.6", "Листинг 2.7", "Листинг 2.8",
         "Листинг 2.9", "Листинг 2.10", "Листинг 2.11", "Листинг 2.12",
         "Листинг 2.13", "Листинг 2.14", "Листинг 2.15", "Листинг 2.16",
         "Листинг 2.17", "Листинг 2.18", "Листинг 2.19", "Листинг 2.20",
         "Листинг 2.21", "Листинг 2.22", "Листинг 2.23", "Листинг 2.24",
         "Листинг 2.25", "Листинг 2.26", "Листинг 2.27", "Листинг 2.28",
         "Листинг 2.29", "Листинг 2.30", "Листинг 2.31", "Листинг 2.32",
         "Листинг 2.33", "Листинг 2.34", "Листинг 2.35", "Листинг 2.36",
         "Листинг 2.37", "Листинг 2.38", "Листинг 2.39", "Листинг 2.40",
         "Листинг 2.41", "Листинг 2.42", "Листинг 2.43", "Листинг 2.44",
         "Листинг 2.45", "Листинг 2.46", "Листинг 2.47", "Листинг 2.48",
         "Листинг 2.49", "Листинг 2.50", "Листинг 2.51", "Листинг 2.52",
         "Листинг 2.53", "Листинг 2.54", "Листинг 2.55", "Листинг 2.56",
         "Листинг 2.57", "Листинг 2.58", "Листинг 2.59", "Листинг 2.60",
         "Листинг 2.61", "Листинг 2.62", "Листинг 2.63", "Листинг 2.64", "Листинг 2.65",
         "Листинг 2.66", "Листинг 2.67", "Листинг 2.68", "Листинг 2.69", "Листинг 2.70",
         "Листинг 2.71", "Листинг 2.72", "Листинг 2.73", "Листинг 2.74", "Листинг 2.75",
         "Листинг 2.76", "Листинг 2.77", "Листинг 2.78", "Листинг 2.79", "Листинг 2.80",
         "Листинг 2.81", "Листинг 2.82", "Листинг 2.83", "Листинг 2.84", "Листинг 2.85",
         "Листинг 2.86", "Листинг 2.87", "Листинг 2.88", "Листинг 2.89", "Листинг 2.90",
         "Листинг 2.91", "Листинг 2.92", "Листинг 2.93", "Листинг 2.94", "Листинг 2.95",
         "Листинг 2.96", "Листинг 2.97", "Листинг 2.98", "Листинг 2.99", "Листинг 2.100",
         "Листинг 2.101", "Листинг 2.102", "Листинг 2.103", "Листинг 2.104", "Листинг 2.105",
         "Листинг 2.106", "Листинг 2.107", "Листинг 2.108", "Листинг 2.109", "Листинг 2.110",
         "Листинг 2.111", "Листинг 2.112", "Листинг 2.113", "Листинг 2.114", "Листинг 2.115",
         "Листинг 2.116", "Листинг 2.117", "Листинг 2.118", "Листинг 2.119", "Листинг 2.120",
         "Листинг 2.121", "Листинг 2.122", "Листинг 2.123", "Листинг 2.124"
         ),
        index=None,
        placeholder="Выберите листинг..."
    )

# Контейнер
cont_2 = st.container(width=800)
with cont_2:
    if options == "Листинг 2.33":
        st.page_link('https://nextleap.app/online-compiler/python-programming', label='🛠️ Редактор код ✍🏻')
        # st.page_link('https://www.online-ide.com/online_python_editor', label='🛠️ Редактор код ✍🏻')
    else:
        st.page_link('https://pythonlib.ru/sandbox', label='🛠️ Редактор код ✍🏻')

    if options is None:
        st.write('Листинг не выбран')
        st.image("Python_Book.jpg", width=350)
    elif options == "Листинг 2.1":
        path = 'pages/glava_2/Listing_2_1.py'
        file = open(path, 'r')
        code = file.read()
        st.code(code, language="python", line_numbers=True)
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_1()
    elif options == "Листинг 2.2":
        path = 'pages/glava_2/Listing_2_2.py'
        file = open(path, 'r')
        code = file.read()
        st.code(code, language="python", line_numbers=True)
        st.divider()  # Разделитель
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_2()
    elif options == "Листинг 2.3":
        st.write('Код листинга 2.3')
        path = 'pages/glava_2/Listing_2_3.py'
        file = open(path, 'r')
        code = file.read()
        st.code(code, language="python", line_numbers=True)
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_3()
    elif options == "Листинг 2.4":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_4()
    elif options == "Листинг 2.5":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_5()
    elif options == "Листинг 2.6":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_6()
    elif options == "Листинг 2.7":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_7()
    elif options == "Листинг 2.8":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_8()
    elif options == "Листинг 2.9":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_9()
    elif options == "Листинг 2.10":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_10()
    elif options == "Листинг 2.11":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_11()
    elif options == "Листинг 2.12":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_12()
    elif options == "Листинг 2.13":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_13()
    elif options == "Листинг 2.14":
        with st.expander("Показать результат"):
            fun_g2.run_2_14()
    elif options == "Листинг 2.15":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_15()
    elif options == "Листинг 2.16":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_16()
    elif options == "Листинг 2.17":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_17()
    elif options == "Листинг 2.18":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_18()
    elif options == "Листинг 2.19":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_19()
    elif options == "Листинг 2.20":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_20()
    elif options == "Листинг 2.21":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_21()
    elif options == "Листинг 2.22":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_22()
    elif options == "Листинг 2.23":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_23()
    elif options == "Листинг 2.24":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_24()
    elif options == "Листинг 2.25":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_25()
    elif options == "Листинг 2.26":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_26()
    elif options == "Листинг 2.27":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_27()
    elif options == "Листинг 2.28":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_28()
    elif options == "Листинг 2.29":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_29()
    elif options == "Листинг 2.30":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_30()
    elif options == "Листинг 2.31":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_31()
    elif options == "Листинг 2.32":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_32()
    elif options == "Листинг 2.33":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_33()
    elif options == "Листинг 2.34":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_34()
    elif options == "Листинг 2.35":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_35()
    elif options == "Листинг 2.36":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_36()
    elif options == "Листинг 2.37":
        with st.expander("🔍 Показать результат"):
            fun_g2.run_2_37()
    elif options == "Листинг 2.38":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_38()
    elif options == "Листинг 2.39":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_39()
    elif options == "Листинг 2.40":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_40()
    elif options == "Листинг 2.41":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_41()
    elif options == "Листинг 2.42":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_42()
    elif options == "Листинг 2.43":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_43()
    elif options == "Листинг 2.44":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_44()
    elif options == "Листинг 2.45":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_45()
    elif options == "Листинг 2.46":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_46()
    elif options == "Листинг 2.47":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_47()
    elif options == "Листинг 2.48":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_48()
    elif options == "Листинг 2.49":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_49()
    elif options == "Листинг 2.50":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_50()
    elif options == "Листинг 2.51":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_51()
    elif options == "Листинг 2.52":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_52()
    elif options == "Листинг 2.53":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_53()
    elif options == "Листинг 2.54":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_54()
    elif options == "Листинг 2.55":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_55()
    elif options == "Листинг 2.56":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_56()
    elif options == "Листинг 2.57":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_57()
    elif options == "Листинг 2.58":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_58()
    elif options == "Листинг 2.59":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_59()
    elif options == "Листинг 2.60":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_60()
    elif options == "Листинг 2.61":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_61()
    elif options == "Листинг 2.62":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_62()
    elif options == "Листинг 2.63":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_63()
    elif options == "Листинг 2.64":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_64()
    elif options == "Листинг 2.65":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_65()
    elif options == "Листинг 2.66":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_66()
    elif options == "Листинг 2.67":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_67()
    elif options == "Листинг 2.68":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_68()
    elif options == "Листинг 2.69":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_69()
    elif options == "Листинг 2.70":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_70()
    elif options == "Листинг 2.71":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_71()
    elif options == "Листинг 2.72":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_72()
    elif options == "Листинг 2.73":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_73()
    elif options == "Листинг 2.74":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_74()
    elif options == "Листинг 2.75":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_75()
    elif options == "Листинг 2.76":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_76()
    elif options == "Листинг 2.77":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_77()
    elif options == "Листинг 2.78":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_78()
    elif options == "Листинг 2.79":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_79()
    elif options == "Листинг 2.80":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_80()
    elif options == "Листинг 2.81":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_81()
    elif options == "Листинг 2.82":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_82()
    elif options == "Листинг 2.83":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_83()
    elif options == "Листинг 2.84":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_84()
    elif options == "Листинг 2.85":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_85()
    elif options == "Листинг 2.86":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_86()
    elif options == "Листинг 2.87":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_87()
    elif options == "Листинг 2.88":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_88()
    elif options == "Листинг 2.89":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_89()
    elif options == "Листинг 2.90":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_90()
    elif options == "Листинг 2.91":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_91()
    elif options == "Листинг 2.92":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_92()
    elif options == "Листинг 2.93":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_93()
    elif options == "Листинг 2.94":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_94()
    elif options == "Листинг 2.95":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_95()
    elif options == "Листинг 2.96":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_96()
    elif options == "Листинг 2.97":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_97()
    elif options == "Листинг 2.98":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_98()
    elif options == "Листинг 2.99":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_99()
    elif options == "Листинг 2.100":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_100()
    elif options == "Листинг 2.101":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_101()
    elif options == "Листинг 2.102":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_102()
    elif options == "Листинг 2.103":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_103()
    elif options == "Листинг 2.104":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_104()
    elif options == "Листинг 2.105":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_105()
    elif options == "Листинг 2.106":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_106()
    elif options == "Листинг 2.107":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_107()
    elif options == "Листинг 2.108":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_108()
    elif options == "Листинг 2.109":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_109()
    elif options == "Листинг 2.110":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_110()
    elif options == "Листинг 2.111":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_111()
    elif options == "Листинг 2.112":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_112()
    elif options == "Листинг 2.113":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_113()
    elif options == "Листинг 2.114":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_114()
    elif options == "Листинг 2.115":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_115()
    elif options == "Листинг 2.116":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_116()
    elif options == "Листинг 2.117":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_117()
    elif options == "Листинг 2.118":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_118()
    elif options == "Листинг 2.119":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_119()
    elif options == "Листинг 2.120":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_120()
    elif options == "Листинг 2.121":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_121()
    elif options == "Листинг 2.122":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_122()
    elif options == "Листинг 2.123":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_123()
    elif options == "Листинг 2.124":
        with st.expander("🔍Показать результат"):
            fun_g2.run_2_124()
